apache/nuttx/arch/arm/src/stm32/stm32_otghsdev.c
  if (priv->driver)
    {
      CLASS_SUSPEND(priv->driver, &priv->usbdev);
    }

#ifdef CONFIG_USBDEV_LOWPOWER
  /* OTGHS_DSTS_SUSPSTS is set as long as the suspend condition is detected
   * on USB.  Check if we are still have the suspend condition, that we are
   * connected to the host, and that we have been configured.
   */

  regval = stm32_getreg(STM32_OTGHS_DSTS);

  if ((regval & OTGHS_DSTS_SUSPSTS) != 0 && devstate == DEVSTATE_CONFIGURED)
    {
      /* Switch off OTG HS clocking.  Setting OTGHS_PCGCCTL_STPPCLK stops the
       * PHY clock.
       */

      regval = stm32_getreg(STM32_OTGHS_PCGCCTL);
      regval |= OTGHS_PCGCCTL_STPPCLK;
      stm32_putreg(regval, STM32_OTGHS_PCGCCTL);

      /* Setting OTGHS_PCGCCTL_GATEHCLK gate HCLK to modules other than
       * the AHB Slave and Master and wakeup logic.
       */

      regval |= OTGHS_PCGCCTL_GATEHCLK;
      stm32_putreg(regval, STM32_OTGHS_PCGCCTL);
    }
#endif

  /* Let the board-specific logic know that we have entered the suspend
   * state
   */

  stm32_usbsuspend((struct usbdev_s *)priv, false);
}

/****************************************************************************
 * Name: stm32_rxinterrupt
 *
 * Description:
 *   RxFIFO non-empty interrupt.  This interrupt indicates that there is at
 *   least one packet pending to be read from the RxFIFO.
 *
 ****************************************************************************/

static inline void stm32_rxinterrupt(struct stm32_usbdev_s *priv)
{
  struct stm32_ep_s *privep;
  uint32_t regval;
  int bcnt;
  int epphy;

  /* Disable the Rx status queue level interrupt */

  regval = stm32_getreg(STM32_OTGHS_GINTMSK);
  regval &= ~OTGHS_GINT_RXFLVL;
  stm32_putreg(regval, STM32_OTGHS_GINTMSK);

  /* Get the status from the top of the FIFO */

  regval = stm32_getreg(STM32_OTGHS_GRXSTSP);

  /* Decode status fields */

  epphy  = (regval & OTGHS_GRXSTSD_EPNUM_MASK) >> OTGHS_GRXSTSD_EPNUM_SHIFT;

  if (epphy < STM32_NENDPOINTS)
    {
      privep = &priv->epout[epphy];

      /* Handle the RX event according to the packet status field */

      switch (regval & OTGHS_GRXSTSD_PKTSTS_MASK)
        {
        /* Global OUT NAK.  This indicate that the global OUT NAK bit has
         * taken effect.
         *
         * PKTSTS = Global OUT NAK, BCNT = 0,
         * EPNUM = Don't Care, DPID = Don't Care.
         */

        case OTGHS_GRXSTSD_PKTSTS_OUTNAK:
          {
            usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_OUTNAK), 0);
          }
          break;

        /* OUT data packet received.
         *
         * PKTSTS = DataOUT, BCNT = size of the received data OUT packet,
         * EPNUM = EPNUM on which the packet was received,
         * DPID = Actual Data PID.
         */

        case OTGHS_GRXSTSD_PKTSTS_OUTRECVD:
          {
            usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_OUTRECVD), epphy);
            bcnt = (regval & OTGHS_GRXSTSD_BCNT_MASK) >>
                   OTGHS_GRXSTSD_BCNT_SHIFT;
            if (bcnt > 0)
              {
                stm32_epout_receive(privep, bcnt);
              }
          }
          break;

        /* OUT transfer completed.  This indicates that an OUT data transfer
         * for the specified OUT endpoint has completed. After this entry is
         * popped from the receive FIFO, the core asserts a Transfer
         * Completed interrupt on the specified OUT endpoint.
         *
         * PKTSTS = Data OUT Transfer Done, BCNT = 0, EPNUM = OUT EP Num on
         * which the data transfer is complete, DPID = Don't Care.
         */

        case OTGHS_GRXSTSD_PKTSTS_OUTDONE:
          {
            usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_OUTDONE), epphy);
          }
          break;

        /* SETUP transaction completed. This indicates that the Setup stage
         * for the specified endpoint has completed and the Data stage has
         * started. After this entry is popped from the receive FIFO, the
         * core asserts a Setup interrupt on the specified control OUT
         * endpoint (triggers an interrupt).
         *
         * PKTSTS = Setup Stage Done, BCNT = 0, EPNUM = Control EP Num,
         * DPID = Don't Care.
        */

        case OTGHS_GRXSTSD_PKTSTS_SETUPDONE:
          {
            usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_SETUPDONE), epphy);
          }
          break;

        /* SETUP data packet received.  This indicates that a SETUP packet
         * for the specified endpoint is now available for reading from the
         * receive FIFO.
         *
         * PKTSTS = SETUP, BCNT = 8, EPNUM = Control EP Num, DPID = D0.
         */

        case OTGHS_GRXSTSD_PKTSTS_SETUPRECVD:
          {
            uint16_t datlen;

            usbtrace(TRACE_INTDECODE(STM32_TRACEINTID_SETUPRECVD), epphy);

            /* Read EP0 setup data.  NOTE:  If multiple SETUP packets are
             * received, the last one overwrites the previous setup packets
             * and only that last SETUP packet will be processed.
             */

           stm32_rxfifo_read(&priv->epout[EP0],
                             (uint8_t *)&priv->ctrlreq,
                             USB_SIZEOF_CTRLREQ);

            /* Was this an IN or an OUT SETUP packet.  If it is an OUT SETUP,
             * then we need to wait for the completion of the data phase to
             * process the setup command.  If it is an IN SETUP packet, then
             * we must processing the command BEFORE we enter the DATA phase.
             *
             * If the data associated with the OUT SETUP packet is zero
             * length, then, of course, we don't need to wait.
             */

            datlen = GETUINT16(priv->ctrlreq.len);
            if (USB_REQ_ISOUT(priv->ctrlreq.type) && datlen > 0)
              {
                /* Clear NAKSTS so that we can receive the data */

                regval  = stm32_getreg(STM32_OTGHS_DOEPCTL0);
                regval |= OTGHS_DOEPCTL0_CNAK;
                stm32_putreg(regval, STM32_OTGHS_DOEPCTL0);

                /* Wait for the data phase. */

                priv->ep0state = EP0STATE_SETUP_OUT;
              }
            else
              {
                /* We can process the setup data as soon as SETUP done word
                 * is popped of the RxFIFO.
                 */

