apache/nuttx/arch/arm/src/stm32/stm32_otghsdev.c
  regval  = stm32_getreg(STM32_OTGHS_GUSBCFG);
  regval &= ~OTGHS_GUSBCFG_FHMOD;
  regval |= OTGHS_GUSBCFG_FDMOD;
  stm32_putreg(regval, STM32_OTGHS_GUSBCFG);
  up_mdelay(50);

  /* Initialize device mode */

  /* Restart the PHY Clock */

  stm32_putreg(0, STM32_OTGHS_PCGCCTL);

  /* Device configuration register */

  regval = stm32_getreg(STM32_OTGHS_DCFG);
  regval &= ~OTGHS_DCFG_PFIVL_MASK;
  regval |= OTGHS_DCFG_PFIVL_80PCT;
  stm32_putreg(regval, STM32_OTGHS_DCFG);

  /* Set full speed PHY */

  regval = stm32_getreg(STM32_OTGHS_DCFG);
  regval &= ~OTGHS_DCFG_DSPD_MASK;
  regval |= OTGHS_DCFG_DSPD_FS;
  stm32_putreg(regval, STM32_OTGHS_DCFG);

  /* Set Rx FIFO size */

  stm32_putreg(STM32_RXFIFO_WORDS, STM32_OTGHS_GRXFSIZ);

  /* EP0 TX */

  address = STM32_RXFIFO_WORDS;
  regval  = (address << OTGHS_DIEPTXF0_TX0FD_SHIFT) |
            (STM32_EP0_TXFIFO_WORDS << OTGHS_DIEPTXF0_TX0FSA_SHIFT);
  stm32_putreg(regval, STM32_OTGHS_DIEPTXF0);

  /* EP1 TX */

  address += STM32_EP0_TXFIFO_WORDS;
  regval   = (address << OTGHS_DIEPTXF_INEPTXSA_SHIFT) |
             (STM32_EP1_TXFIFO_WORDS << OTGHS_DIEPTXF_INEPTXFD_SHIFT);
  stm32_putreg(regval, STM32_OTGHS_DIEPTXF1);

  /* EP2 TX */

  address += STM32_EP1_TXFIFO_WORDS;
  regval   = (address << OTGHS_DIEPTXF_INEPTXSA_SHIFT) |
             (STM32_EP2_TXFIFO_WORDS << OTGHS_DIEPTXF_INEPTXFD_SHIFT);
  stm32_putreg(regval, STM32_OTGHS_DIEPTXF2);

  /* EP3 TX */

  address += STM32_EP2_TXFIFO_WORDS;
  regval   = (address << OTGHS_DIEPTXF_INEPTXSA_SHIFT) |
             (STM32_EP3_TXFIFO_WORDS << OTGHS_DIEPTXF_INEPTXFD_SHIFT);
  stm32_putreg(regval, STM32_OTGHS_DIEPTXF3);

  /* Flush the FIFOs */

  stm32_txfifo_flush(OTGHS_GRSTCTL_TXFNUM_DALL);
  stm32_rxfifo_flush();

  /* Clear all pending Device Interrupts */

  stm32_putreg(0, STM32_OTGHS_DIEPMSK);
  stm32_putreg(0, STM32_OTGHS_DOEPMSK);
  stm32_putreg(0, STM32_OTGHS_DIEPEMPMSK);
  stm32_putreg(0xffffffff, STM32_OTGHS_DAINT);
  stm32_putreg(0, STM32_OTGHS_DAINTMSK);

  /* Configure all IN endpoints */

  for (i = 0; i < STM32_NENDPOINTS; i++)
    {
      regval = stm32_getreg(STM32_OTGHS_DIEPCTL(i));
      if ((regval & OTGHS_DIEPCTL_EPENA) != 0)
        {
          /* The endpoint is already enabled */

          regval = OTGHS_DIEPCTL_EPENA | OTGHS_DIEPCTL_SNAK;
        }
      else
        {
          regval = 0;
        }

      stm32_putreg(regval, STM32_OTGHS_DIEPCTL(i));
      stm32_putreg(0, STM32_OTGHS_DIEPTSIZ(i));
      stm32_putreg(0xff, STM32_OTGHS_DIEPINT(i));
    }

  /* Configure all OUT endpoints */

  for (i = 0; i < STM32_NENDPOINTS; i++)
    {
      regval = stm32_getreg(STM32_OTGHS_DOEPCTL(i));
      if ((regval & OTGHS_DOEPCTL_EPENA) != 0)
        {
          /* The endpoint is already enabled */

          regval = OTGHS_DOEPCTL_EPENA | OTGHS_DOEPCTL_SNAK;
        }
      else
        {
          regval = 0;
        }

      stm32_putreg(regval, STM32_OTGHS_DOEPCTL(i));
      stm32_putreg(0, STM32_OTGHS_DOEPTSIZ(i));
      stm32_putreg(0xff, STM32_OTGHS_DOEPINT(i));
    }

  /* Disable all interrupts. */

  stm32_putreg(0, STM32_OTGHS_GINTMSK);

  /* Clear any pending USB_OTG Interrupts */

  stm32_putreg(0xffffffff, STM32_OTGHS_GOTGINT);

  /* Clear any pending interrupts */

  stm32_putreg(0xbfffffff, STM32_OTGHS_GINTSTS);

#ifndef BOARD_ENABLE_USBOTG_HSULPI
  /* Disable the ULPI Clock enable in RCC AHB1 Register.  This must
   * be done because if both the ULPI and the FS PHY clock enable bits
   * are set at the same time, the ARM never awakens from WFI due to
   * some bug / errata in the chip.
   */

  regval  = stm32_getreg(STM32_RCC_AHB1LPENR);
  regval &= ~RCC_AHB1ENR_OTGHSULPIEN;
  stm32_putreg(regval, STM32_RCC_AHB1LPENR);
#endif

  /* Enable the interrupts in the INTMSK */

  regval  = (OTGHS_GINT_RXFLVL | OTGHS_GINT_USBSUSP | OTGHS_GINT_ENUMDNE |
             OTGHS_GINT_IEP | OTGHS_GINT_OEP | OTGHS_GINT_USBRST);

#ifdef CONFIG_USBDEV_ISOCHRONOUS
  regval |= (OTGHS_GINT_IISOIXFR | OTGHS_GINT_IISOOXFR);
#endif

#ifdef CONFIG_USBDEV_SOFINTERRUPT
  regval |= OTGHS_GINT_SOF;
#endif

#ifdef CONFIG_USBDEV_VBUSSENSING
  regval |= (OTGHS_GINT_OTG | OTGHS_GINT_SRQ);
#endif

#ifdef CONFIG_DEBUG_USB
  regval |= OTGHS_GINT_MMIS;
#endif

  stm32_putreg(regval, STM32_OTGHS_GINTMSK);

  /* Enable the USB global interrupt by setting GINTMSK in the global OTG
   * HS AHB configuration register; Set the TXFELVL bit in the GAHBCFG
   * register so that TxFIFO interrupts will occur when the TxFIFO is truly
   * empty (not just half full).
   */

  stm32_putreg(OTGHS_GAHBCFG_GINTMSK | OTGHS_GAHBCFG_TXFELVL,
               STM32_OTGHS_GAHBCFG);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: arm_usbinitialize
 *
 * Description:
 *   Initialize USB hardware.
 *
 * Assumptions:
 * - This function is called very early in the initialization sequence
 * - PLL and GIO pin initialization is not performed here but should been in
 *   the low-level  boot logic:  PLL1 must be configured for operation at
 *   48MHz and P0.23 and PO.31 in PINSEL1 must be configured for Vbus and USB
 *   connect LED.
 *
 ****************************************************************************/

void arm_usbinitialize(void)
{
  /* At present, there is only a single OTG HS device support. Hence it is
   * pre-allocated as g_otghsdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct stm32_usbdev_s *priv = &g_otghsdev;
  int ret;

  usbtrace(TRACE_DEVINIT, 0);

  /* Here we assume that:
   *
   * 1. GPIOA and OTG HS peripheral clocking has already been enabled as part
   *    of the boot sequence.
   * 2. Board-specific logic has already enabled other board specific GPIOs
   *    for things like soft pull-up, VBUS sensing, power controls, and over-
   *    current detection.
   */

  /* Configure OTG HS alternate function pins
   *
   * PIN* SIGNAL      DIRECTION
   * ---- ----------- ----------
   * PA8  OTG_HS_SOF  SOF clock output
   * PA9  OTG_HS_VBUS VBUS input for device, Driven by external regulator by
   *                  host (not an alternate function)
   * PA10 OTG_HS_ID   OTG ID pin (only needed in Dual mode)
   * PA11 OTG_HS_DM   D- I/O
   * PA12 OTG_HS_DP   D+ I/O
   *
   * *Pins may vary from device-to-device.
   */

  stm32_configgpio(GPIO_OTGHS_DM);
  stm32_configgpio(GPIO_OTGHS_DP);
  stm32_configgpio(GPIO_OTGHS_ID);    /* Only needed for OTG */

  /* SOF output pin configuration is configurable. */

#ifdef CONFIG_STM32_OTGHS_SOFOUTPUT
  stm32_configgpio(GPIO_OTGHS_SOF);
#endif

  /* Uninitialize the hardware so that we know that we are starting from a
   * known state.
   */

